import { applyUuid } from '@steklo24/utils';

export const aboutLinks = applyUuid([
  {
    title: 'Доставка',
    link: '#!',
  },
  {
    title: 'Оплата',
    link: '#!',
  },
  {
    title: 'О нас',
    link: '#!',
  },
  {
    title: 'Производство',
    link: '#!',
  },
  {
    title: 'Личный кабинет',
    link: '#!',
  },
  {
    title: 'Схема работы',
    link: '#!',
  },
  {
    title: 'Шоурум',
    link: '#!',
  },
  {
    title: 'Технические условия',
    link: '#!',
  },
  {
    title: 'Возврат',
    link: '#!',
  },
  {
    title: 'Гарантии',
    link: '#!',
  },
  {
    title: 'Конфиден&shyциальность',
    link: '#!',
  },
  {
    title: 'Договор оферты',
    link: '#!',
  },
]);

export const serviceLinks = applyUuid([
  {
    title: 'Вырез отверстий',
    link: '#!',
  },
  {
    title: 'Зенковка',
    link: '#!',
  },
  {
    title: 'Вырез под чашечную петлю',
    link: '#!',
  },
  {
    title: 'Вырез под двойную розетку',
    link: '#!',
  },
  {
    title: 'Вырез под тройную розетку',
    link: '#!',
  },
  {
    title: 'Вырез Микки Маус',
    link: '#!',
  },
  {
    title: 'Вырез под дверные фитинги',
    link: '#!',
  },
  {
    title: 'Скругления углов',
    link: '#!',
  },
  {
    title: 'Закалка',
    link: '#!',
  },
  {
    title: 'Фацет',
    link: '#!',
  },
  {
    title: 'Покраска стекла RAL',
    link: '#!',
  },
  {
    title: 'Матирование',
    link: '#!',
  },
  {
    title: 'Пескоструй',
    link: '#!',
  },
  {
    title: 'Полноцветная печать на стекле',
    link: '#!',
  },
  {
    title: 'Двусторонний фацет',
    link: '#!',
  },
  {
    title: 'Бронепленка',
    link: '#!',
  },
]);

export const bottomTextItems = [
  `Для оплаты (ввода реквизитов Вашей карты) Вы будете перенаправлены на платежный шлюз ПАО СБЕРБАНК. Соединение с платежным шлюзом и передача информации осуществляется в защищенном режиме с использованием протокола шифрования SSL. В случае если Ваш банк поддерживает технологию безопасного проведения интернет-платежей Verified By Visa, MasterCard SecureCode, MIR Accept, J-Secure для проведения платежа также может потребоваться ввод специального пароля.`,
  `Настоящий сайт поддерживает 256-битное шифрование. Конфиденциальность сообщаемой персональной информации обеспечивается ПАО СБЕРБАНК. Введенная информация не будет предоставлена третьим лицам за исключением случаев, предусмотренных законодательством РФ. Проведение платежей по банковским картам осуществляется в строгом соответствии с требованиями платежных систем МИР, Visa Int., MasterCard Europe Sprl, JCB.`,
];
